In [49]:
import pandas as pd
from sqlalchemy import create_engine

## 1. Store "Income by Country" xlsx into DataFrame

In [50]:
income_path = '../Resources/Income by Country.xlsx'
income_xls = pd.ExcelFile(income_path)
income_15_18 = pd.read_excel(income_xls,'GNI per capita')

### Select columns

In [50]:
income_15_18 = income_15_18[['Country',2015,2016,2017,2018]]
income_15_18.head()

       Country   2015   2016   2017   2018
0  Afghanistan   1783   1766   1767   1746
1      Albania  11098  11534  11831  12300
2      Algeria  13330  13832  13656  13639
3      Andorra  45260  46553  47550  48641
4       Angola   6440   6051   5950   5555

### Convert between rows and columns

In [51]:
income_15_18 = income_15_18.melt(id_vars=["Country"], 
        var_name="Year", 
        value_name="GNI per capita")
income_15_18.head()

       Country  Year GNI per capita
0  Afghanistan  2015           1783
1      Albania  2015          11098
2      Algeria  2015          13330
3      Andorra  2015          45260
4       Angola  2015           6440

### Sort rows by country and year

In [52]:
income_15_18 = income_15_18.sort_values(['Country','Year'],ascending=True).reset_index(drop=True)
income_15_18.head()

       Country  Year GNI per capita
0  Afghanistan  2015           1783
1  Afghanistan  2016           1766
2  Afghanistan  2017           1767
3  Afghanistan  2018           1746
4      Albania  2015          11098

## 2. Use a loop tp store "Happiness" csv into DataFrame and select columns that we want

In [53]:
years = [2015,2016,2017,2018]
def df(year):
    happiness_path = f'../Resources/{year}.csv'
    happiness_df = pd.read_csv(happiness_path)
    happiness_df['Year'] = year
    happiness_df = happiness_df[['Country','Year','Happiness Score']]
    return happiness_df

happiness_years = [df(year) for year in years]

### Append happiness dataframes from 2015-2018 together

In [53]:
happiness_15_18 = happiness_years[0].append([happiness_years[1],happiness_years[2],happiness_years[3]])

### Sort rows by country and year

In [53]:
happiness_15_18 = happiness_15_18.sort_values(['Country','Year'],ascending=True).reset_index(drop=True)
happiness_15_18.head()

       Country  Year  Happiness Score
0  Afghanistan  2015            3.575
1  Afghanistan  2016            3.360
2  Afghanistan  2017            3.794
3  Afghanistan  2018            3.632
4      Albania  2015            4.959

## 3. Combine the income and happiness dataframe together depending on the country and year

In [55]:
combined_df = income_15_18.merge(happiness_15_18,on=['Country','Year'])
combined_df.head(8)

       Country  Year GNI per capita  Happiness Score
0  Afghanistan  2015           1783            3.575
1  Afghanistan  2016           1766            3.360
2  Afghanistan  2017           1767            3.794
3  Afghanistan  2018           1746            3.632
4      Albania  2015          11098            4.959
5      Albania  2016          11534            4.655
6      Albania  2017          11831            4.644
7      Albania  2018          12300            4.586